Revit 2027 API
SimpleWorksetConfiguration Enumeration
 Indicates the set of user-created worksets to open in memory
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SimpleWorksetConfiguration
Public Enumeration SimpleWorksetConfiguration
public enum class SimpleWorksetConfiguration
type SimpleWorksetConfiguration
Members
Member name | Value | Description
AllEditable | 1 |  All user-created worksets checked out to the current user.
AllWorksets | 0 |  All user-created worksets.
AskUserToSpecify | 3 |  Explicitly ask the user the specify which user-created worksets to open.
LastViewed | 2 |  The set of user-created worksets last opened for this model.
See Also
Reference
Autodesk.Revit.DB Namespace